Revit 2027 API
NumberingSchema.SetMinimumNumberOfDigits Method
Note: This API is now obsolete.
 Sets a new value for the minimum number of digits to be used for formating the Number parameter of all numbered elements of the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")]
public static void SetMinimumNumberOfDigits(
	Document document,
	int value
)
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")>
Public Shared Sub SetMinimumNumberOfDigits (
	document As Document,
	value As Integer
)
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")]
static void SetMinimumNumberOfDigits(
	Document^ document,
	int value
)
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version of Revit. This function works only for Rebar, Reinforcement and Coupler elements, an exception will be generated if invoked on numbering schemas that scope other categories. <p>The generic functionality for this was moved in the NumberingFormatSettings.</p>")>]
static member SetMinimumNumberOfDigits :
        document : Document *
        value : int -> unit
Parameters
document Document
 The document in which the new value will be in applied.
value Int32
 New value for the minimum number of digits.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The minimum number of digits must be in range from 1 to 10.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
Valid values range from 1 to 10. Numbers with fewer digits than the minimum number will be padded with leading zeros.
The value affects all numbering schemas. Thus, once set, numbers for Rebar and Reinforcement Fabric will be formatted with the same minimum number of digits.
The current value can obtained by invoking the GetMinimumNumberOfDigits(Document) method.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace